[
  {
    "id": 1,
    "title": "Hot Potato Debate",
    "type": "Stirrer",
    "difficulty": "Medium",
    "time": "5-10 Min",
    "desc": "Students pass a ball while music plays. When it stops, the holder must instantly give an argument.",
    "skills": ["Speaking", "Critical Thinking", "Fluency"],
    "icon": "flame",
    "steps": [
      "Play upbeat music while students pass a ball or object around the circle.",
      "Stop the music randomly.",
      "Display a controversial but lighthearted topic (e.g., 'Cats are better than dogs').",
      "The student holding the object must immediately give one argument FOR or AGAINST.",
      "Resume music immediately to keep energy high."
    ],
    "variation": "Use 'Truth or Dare' questions instead of debate topics for a fun ice-breaker."
  },
  {
    "id": 2,
    "title": "Silent Comic Strip",
    "type": "Settler",
    "difficulty": "Hard",
    "time": "15-20 Min",
    "desc": "Students fill in empty speech bubbles of a comic strip to create a coherent story silently.",
    "skills": ["Writing", "Creativity", "Grammar"],
    "icon": "pen-tool",
    "steps": [
      "Distribute a comic strip with empty speech bubbles to each student.",
      "Set a timer for 10 minutes of absolute silence.",
      "Students must write dialogue that makes sense narratively.",
      "After time is up, students swap comics and read their partner's story."
    ],
    "variation": "Cut the comic panels out separately and have students rearrange them before writing."
  },
  {
    "id": 3,
    "title": "Board Race",
    "type": "Stirrer",
    "difficulty": "Easy",
    "time": "10 Min",
    "desc": "Two teams relay race to the board to write words related to a topic.",
    "skills": ["Vocabulary", "Spelling", "Teamwork"],
    "icon": "flag",
    "steps": [
      "Divide class into two teams standing in lines.",
      "Give the first student in each line a marker.",
      "Shout a category (e.g., 'Animals').",
      "Students run to the board, write one word, run back, and pass the marker.",
      "The team with the most correct words after 2 minutes wins."
    ],
    "variation": "Restrict words to a specific letter (e.g., Animals starting with 'B')."
  },
  {
    "id": 4,
    "title": "Two Truths & A Lie",
    "type": "Settler",
    "difficulty": "Easy",
    "time": "15 Min",
    "desc": "Students spot the lie among three statements about their peers.",
    "skills": ["Speaking", "Listening", "Questions"],
    "icon": "help-circle",
    "steps": [
      "Give students 3 minutes to write down two true facts and one lie about themselves.",
      "In small groups, one student reads their three statements.",
      "The group can ask 3 follow-up questions to try and catch them out.",
      "The group votes on which statement is the lie."
    ],
    "variation": "Teacher plays first to model the activity and build rapport."
  },
  {
    "id": 5,
    "title": "Running Dictation",
    "type": "Stirrer",
    "difficulty": "Hard",
    "time": "20 Min",
    "desc": "A memory and running game where students dictate texts found on walls.",
    "skills": ["Reading", "Speaking", "Writing"],
    "icon": "activity",
    "steps": [
      "Stick short texts on walls outside the classroom or in the hallway.",
      "Pair students: one 'Runner' and one 'Scribe'.",
      "Runner runs to the text, memorizes a sentence, runs back, and dictates it.",
      "Scribe writes it down. If they forget, the Runner must go back.",
      "First pair to write the text correctly wins."
    ],
    "variation": "Swap roles halfway through the text."
  },
  {
    "id": 6,
    "title": "Vocab Pictionary",
    "type": "Stirrer",
    "difficulty": "Easy",
    "time": "10-15 Min",
    "desc": "Drawing vocabulary words for teammates to guess.",
    "skills": ["Vocabulary", "Association"],
    "icon": "image",
    "steps": [
      "Prepare a stack of cards with vocabulary words.",
      "One student comes to the front, picks a card.",
      "They have 60 seconds to draw the word on the board without speaking or writing letters.",
      "Their team must guess the word."
    ],
    "variation": "Use 'Claymation' style where they mold the word with playdough."
  },
  {
    "id": 7,
    "title": "Sentence Surgery",
    "type": "Settler",
    "difficulty": "Medium",
    "time": "15 Min",
    "desc": "Physical rearrangement of jumbled sentence parts.",
    "skills": ["Grammar", "Syntax", "Reading"],
    "icon": "scissors",
    "steps": [
      "Prepare envelopes containing strips of paper with words from a sentence.",
      "Give an envelope to each pair of students.",
      "Students dump the words and rearrange them physically to form a correct sentence.",
      "They raise their hand when they think they have 'healed' the sentence."
    ],
    "variation": "Include one 'distractor' word that doesn't belong in the sentence."
  },
  {
    "id": 8,
    "title": "Back-to-Back Drawing",
    "type": "Settler",
    "difficulty": "Medium",
    "time": "10 Min",
    "desc": "Describing an image to a partner who cannot see it.",
    "skills": ["Listening", "Speaking", "Prepositions"],
    "icon": "headphones",
    "steps": [
      "Pairs sit in chairs back-to-back.",
      "Student A is given a simple picture/diagram.",
      "Student B has a blank paper and pencil.",
      "Student A describes the image using shapes and prepositions (e.g., 'Draw a square in the center').",
      "Compare the drawing with the original."
    ],
    "variation": "Use Tangram puzzles instead of drawing for a tactile version."
  },
  {
    "id": 9,
    "title": "Gallery Walk",
    "type": "Stirrer",
    "difficulty": "Medium",
    "time": "15-25 Min",
    "desc": "Peer review activity walking around the classroom.",
    "skills": ["Reading", "Writing", "Peer Review"],
    "icon": "eye",
    "steps": [
      "Post student work (essays, posters, etc.) on the classroom walls.",
      "Give every student a pack of sticky notes.",
      "Play calm music as students walk around 'viewing the gallery'.",
      "Students leave one compliment and one question on a sticky note for each piece."
    ],
    "variation": "Use different colored sticky notes for different types of feedback (e.g., Pink for praise, Green for growth)."
  }
]